app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
          #params[:author_id] coming from? Rails provides it for us through the nested route,
          #The conditional hinges on whether there's an :author_id key in the params hash — in other words, whether the user navigated to /authors/:id/posts
          @artist = Artist.find_by_id(params[:artist_id])
          #accccounts for the new nest urls, so see if the user is tryting to access all pots or all post form a particular author
          if !@artist
            flash[:alert] = "Artist not found"
            redirect_to artists_path
          else
            @songs = @artist.songs
          end
    else
      @songs = Song.all